In [ ]:
%matplotlib widget

In [56]:
print('Hola')

Hola

In [57]:
1

1

In [58]:
2

2

In [59]:
2 + 3

5

In [60]:
2 * 5

10

In [61]:
3.7

3.7

In [62]:
1.0

1.0

In [63]:
5 * 3

15

In [64]:
"hola"

'hola'

In [65]:
'hola'

'hola'

In [66]:
"""Hola
esto es una cadena"""

'Hola\nesto es una cadena'

In [67]:
c = "Hola"

In [68]:
c

'Hola'

In [69]:
print(c)

Hola

In [70]:
c.upper()

'HOLA'

In [71]:
c

'Hola'

In [72]:
c = c.upper()

In [73]:
c

'HOLA'

In [74]:
c[0]

'H'

c[0] = 'X'

In [75]:
c.upper()

'HOLA'

In [76]:
d = c.upper()

In [77]:
l = [1, 2, 3]

In [78]:
l[0]

1

In [79]:
l[1]

2

In [80]:
l[-1]

3

In [81]:
l[0] = 55

In [82]:
l

[55, 2, 3]

In [83]:
d = {'javi': 2,'juan': 5}

In [84]:
d['javi']

2

In [85]:
d['javi'] += 5

In [86]:
d

{'javi': 7, 'juan': 5}

In [87]:
t = (1, 2, 3, 4)

In [88]:
t[0]

1

In [89]:
t

(1, 2, 3, 4)

t[0] = 122

In [90]:
True

True

In [91]:
False

False

In [92]:
1 == 0

False

In [93]:
l

[55, 2, 3]

In [94]:
l[0] = 'juan'

In [95]:
l[-1] = 5.7

In [96]:
l

['juan', 2, 5.7]

In [97]:
for elem in l:
    print(elem)

juan
2
5.7

In [98]:
for k, v in d.items():
    print(k, v)

javi 7
juan 5

In [99]:
m = [[1, 2],
     [3, 4]]

In [100]:
m[0][0]

1

In [101]:
m[0][1]

2

In [102]:
# Matrices con numpy

In [103]:
import numpy as np

In [104]:
m_array = np.array(m)

In [105]:
m_array

array([[1, 2],
       [3, 4]])

In [106]:
m

[[1, 2], [3, 4]]

In [107]:
m_array.sum()

10

In [108]:
m.sum()

AttributeError: 'list' object has no attribute 'sum'

In [ ]:
m_array.mean()

In [ ]:
m_array.std()

In [ ]:
m_array.std(axis=0)

In [ ]:
m_array.sum(axis=1)

In [ ]:
m_array

In [ ]:
m_array.dtype

In [ ]:
z = np.zeros([2,2])

In [ ]:
z

In [ ]:
z + m_array

In [ ]:
z @ m_array

In [ ]:
o = np.ones([2, 2])

In [ ]:
o + m_array

In [ ]:
o.T

# Pandas

In [109]:
!pip install pandas

El sistema no puede encontrar la ruta especificada.

In [110]:
import pandas as pd

In [111]:
m_array

array([[1, 2],
       [3, 4]])

In [115]:
df = pd.DataFrame(m_array, columns=['Acidez', 'Azucar'])

In [116]:
df

   Acidez  Azucar
0       1       2
1       3       4

In [117]:
df.Acidez

0    1
1    3
Name: Acidez, dtype: int32

In [118]:
df.Azucar

0    2
1    4
Name: Azucar, dtype: int32

In [119]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 2 columns):
Acidez    2 non-null int32
Azucar    2 non-null int32
dtypes: int32(2)
memory usage: 144.0 bytes

In [120]:
df.describe()

         Acidez    Azucar
count  2.000000  2.000000
mean   2.000000  3.000000
std    1.414214  1.414214
min    1.000000  2.000000
25%    1.500000  2.500000
50%    2.000000  3.000000
75%    2.500000  3.500000
max    3.000000  4.000000

In [122]:

df.Acidez.hist()

Canvas(toolbar=Toolbar(toolitems=[('Home', 'Reset original view', 'home', 'home'), ('Back', 'Back to previous …

In [123]:
titanic = pd.read_csv('titanic.csv')

In [126]:
titanic.Name

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [127]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [128]:
titanic.Age.mean()

29.69911764705882

In [129]:
titanic.Age[titanic.Sex == 'male'].mean()

30.72664459161148

In [130]:
titanic.Age[titanic.Sex == 'female'].mean()

27.915708812260537

In [132]:
titanic.dropna(axis=1)

,PassengerId,Survived,Pclass,Name,Sex,SibSp,Parch,Ticket,Fare
0,1,0,3,"Braund, Mr. Owen Harris",male,1,0,A/5 21171,7.2500
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,1,0,PC 17599,71.2833
2,3,1,3,"Heikkinen, Miss. Laina",female,0,0,STON/O2. 3101282,7.9250
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,1,0,113803,53.1000
4,5,0,3,"Allen, Mr. William Henry",male,0,0,373450,8.0500
...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,0,0,211536,13.0000
887,888,1,1,"Graham, Miss. Margaret Edith",female,0,0,112053,30.0000
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,1,2,W./C. 6607,23.4500
889,890,1,1,"Behr, Mr. Karl Howell",male,0,0,111369,30.0000
890,891,0,3,"Dooley, Mr. Patrick",male,0,0,370376,7.7500

In [134]:
titanic.groupby('Sex').mean()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
Sex,,,,,,,
female,431.028662,0.742038,2.159236,27.915709,0.694268,0.649682,44.479818
male,454.147314,0.188908,2.389948,30.726645,0.429809,0.235702,25.523893

In [135]:
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [138]:
import matplotlib.pyplot as plt
plt.figure()
titanic.Age.hist()

Canvas(toolbar=Toolbar(toolitems=[('Home', 'Reset original view', 'home', 'home'), ('Back', 'Back to previous …

In [139]:
import seaborn as sns

In [141]:
sns.pairplot(titanic, hue='Survived')

Canvas(toolbar=Toolbar(toolitems=[('Home', 'Reset original view', 'home', 'home'), ('Back', 'Back to previous …

C:\WPy64-3741\python-3.7.4.amd64\lib\site-packages\statsmodels\nonparametric\kde.py:487: RuntimeWarning: invalid value encountered in true_divide
  binned = fast_linbin(X, a, b, gridsize) / (delta * nobs)
C:\WPy64-3741\python-3.7.4.amd64\lib\site-packages\statsmodels\nonparametric\kdetools.py:34: RuntimeWarning: invalid value encountered in double_scalars
  FAC1 = 2*(np.pi*bw/RANGE)**2
C:\WPy64-3741\python-3.7.4.amd64\lib\site-packages\statsmodels\nonparametric\kde.py:447: RuntimeWarning: invalid value encountered in greater
  X = X[np.logical_and(X > clip[0], X < clip[1])] # won't work for two columns.
C:\WPy64-3741\python-3.7.4.amd64\lib\site-packages\statsmodels\nonparametric\kde.py:447: RuntimeWarning: invalid value encountered in less
  X = X[np.logical_and(X > clip[0], X < clip[1])] # won't work for two columns.